import { Injectable } from '@angular/core';
import { Product } from './product.model';

@Injectable({
  providedIn: 'root'
})
export class ProdlisService {

  constructor() { }

  private items:Product[] = [
    new Product(
      "بلاط جبسم بورد 572/1- 60×60",
      "بلاط سقف جبسم بورد 60×60 ألواح جبس عالية الجودة مضادة للرطوبة والإحتراق وخالية من أي مواد ضارة ,الوجه الأمامي مغطى من طبقة PVC والوجه الخلفي مغطى من طبقة من الألمنيوم (القصدير) ذات الجودة العالية.",
      "/assets/resized-image-Promo (3).jpeg",
      "100 SAR"
    ),
    new Product(
      "بديل رخام ماربوه TAL 012",
      "خيار أمثل وبديل أرخص للرخام الطبيعي ويتميز بتعدد ألوانه كونه صناعي وأقل سماكة وأخف وزنا , مقاوم للأوساخ والتصبغات ويعطي نفس المظهر الجمالي المرغوب.",
      "/assets/TAL012.jpg",
      "200 SAR"

    ),
    new Product(
      "بديل رخام حجر TAL 085",
      "خيار أمثل وبديل أرخص للرخام الطبيعي ويتميز بتعدد ألوانه كونه صناعي وأقل سماكة وأخف وزنا , مقاوم للأوساخ والتصبغات ويعطي نفس المظهر الجمالي المرغوب , يتميز بالملمس والشكل الحجري .",
      "/assets/TAL085-.jpg",
      "100 SAR"

    ),
    new Product(
      "سمارت ستون  طلاء الجرانيت SS 204",
      "دهان حجري فاخر للديكور الداخلي والخارجي, طلاء بلمسة الحجر الفاخر المميز للديكورات الداخلية عبارة عن مزيج من حبيبات الحجر الطبيعي مثل الحجر الرملي الطبيعي والجرانيت يمكن تنفيذه على أسطح مختلفة وهو مثالي للواجهات في المباني السكنية والتجارية , تتميز جميع الأسطح بخصائص فائقة المتانة والقوة ، كما أنها شديدة المقاومة للتأثيرات والحرارة والخدش والتقطيع والتشقق والرطوبة .",
      "/assets/resized-image-Promo (4).jpeg",
      "300 SAR"

    ),
    new Product(
      "سيليكون ألماني - أبيض 280 مل",
      "سيليكون ألماني - أبيض 280 مل",
      "/assets/1.jpg",
      "100 SAR"

    ),

  ];


  getProducts(){
    return this.items.slice();
}
getProduct(index:number){
    return this.items[index];
    
}
}
